app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    if params[:artist_id] and !Artist.exists?(params[:artist_id])